---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinEnable
source: html/ce778422-7f41-a0ed-316f-3d4e1cfcc708.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinEnable Property

The property labeled "Use perlin noise for wood fiber" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberPerlinEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".